In [1]:
import pandas as pd

In [2]:
data_frame = pd.read_csv('inflearn/friend_list.csv')

In [3]:
data_frame

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [6]:
data_frame.head(2)

    name  age        job
0   John   20    student
1  Jenny   30  developer

In [7]:
data_frame.tail(2)

    name  age      job
4  Brian   45  manager
5  Chris   25   intern

In [8]:
type(data_frame.name)

pandas.core.series.Series

In [9]:
type(data_frame.job)
#data frame은 series의 결합체

pandas.core.series.Series

In [10]:
list_tmp = [1,2,3]

In [11]:
list_tmp

[1, 2, 3]

In [12]:
s1 = pd.core.series.Series(  [1,2,3]  )

In [13]:
s2 = pd.core.series.Series(  ['one', 'two', 'three']  )

In [14]:
pd.DataFrame(data=dict(num=s1, word=s2))
#list로 series를 만들고, series로 dataframe을 만들어준다 (pandas가)

   num   word
0    1    one
1    2    two
2    3  three

In [15]:
!conda list | grep pandas

'grep'은(는) 내부 또는 외부 명령, 실행할 수 있는 프로그램, 또는
배치 파일이 아닙니다.

In [16]:
df = pd.read_csv('inflearn/friend_list.csv')

In [17]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [19]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

In [21]:
df = pd.read_csv('inflearn/friend_list.txt')

In [22]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [23]:
df = pd.read_csv('inflearn/friend_list_tab.txt')

In [24]:
df
#tab으로 구분된 txt file임

         name\tage\tjob
0     John\t20\tstudent
1  Jenny\t30\tdeveloper
2     Nate\t30\tteacher
3    Julia\t40\tdentist
4    Brian\t45\tmanager
5     Chris\t25\tintern

In [25]:
df = pd.read_csv('inflearn/friend_list_tab.txt', delimiter = '\t')

In [26]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [3]:
df = pd.read_csv('inflearn/friend_list_no_head.csv')

In [4]:
df

    John  20    student
0  Jenny  30  developer
1   Nate  30    teacher
2  Julia  40    dentist
3  Brian  45    manager
4  Chris  25     intern

In [5]:
df = pd.read_csv('inflearn/friend_list_no_head.csv', header = None)

In [6]:
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher
3  Julia  40    dentist
4  Brian  45    manager
5  Chris  25     intern

In [7]:
df.columns = ['name','age','job']

In [8]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [9]:
df = pd.read_csv('inflearn/friend_list_no_head.csv', header=None, names=['name','age','job'])

In [10]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [14]:
from collections import OrderedDict

In [15]:
friend_ordered_dict = OrderedDict(
    [
        ('name',['John','Nate']),
        ('age',[25,30]),
        ('job',['student','teacher'])
    ]
)

In [16]:
df = pd.DataFrame.from_dict(friend_ordered_dict)

In [17]:
df.head()

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [25]:
friends = [
    {'name' : 'John', 'age' : 25, 'job' : 'student'},
    {'name' : 'Jenny', 'age' : 30, 'job' : None},
    {'name' : 'Nate', 'age' : 30, 'job' : 'teacher'}
]
df = pd.DataFrame(friends)
df = df[['name','age','job']]  #column 순서 조정

In [26]:
df.head()

    name  age      job
0   John   25  student
1  Jenny   30     None
2   Nate   30  teacher

In [28]:
df.to_csv('inflearn/friends.csv', index=True, header=True)
#default settings

In [29]:
df.to_csv('inflearn/friends.csv', index=False, header=True)

In [30]:
df.to_csv('inflearn/friends.csv', index=False, header=False, na_rep = '-')
#N/A 값은 '-'로 대체

In [41]:
friend_list = [
    ['name', ['John','Jenny','Nate']],
    ['age', [20,30,30]],
    ['job', ['student','developer','teacher']]
]
df = pd.DataFrame.from_items(friend_list)

C:\Anaconda3\lib\site-packages\ipykernel_launcher.py:6: FutureWarning: from_items is deprecated. Please use DataFrame.from_dict(dict(items), ...) instead. DataFrame.from_dict(OrderedDict(items)) may be used to preserve the key order.

In [32]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [33]:
df[1:3]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [34]:
df = df[1:3]

In [35]:
df

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [37]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [38]:
df.loc[  [0,2]  ]

   name  age      job
0  John   20  student
2  Nate   30  teacher

In [39]:
df = df.loc[  [0,2]  ]

In [40]:
df

   name  age      job
0  John   20  student
2  Nate   30  teacher

### by column condition

In [43]:
df[df.age > 25]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [44]:
df.query('age>25')

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [45]:
df[  (df.age>25) & (df.name=='Nate')  ]

   name  age      job
2  Nate   30  teacher

## Filter Column

### by index

In [46]:
friend_list = [
    ['John',20,'student'],
    ['Jenny',30,'developer'],
    ['Nate',30,'teacher']
]
column_name = ['name','age','job']
df = pd.DataFrame.from_records(friend_list, columns = column_name)
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [47]:
df.iloc[:,0:2]
#[row,column]

    name  age
0   John   20
1  Jenny   30
2   Nate   30

In [48]:
df.iloc[0:2,0:2]

    name  age
0   John   20
1  Jenny   30

### by column name

In [53]:
df = pd.read_csv('inflearn/friend_list_no_head.csv', header=None, names=['name','age','job'])
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [52]:
df_filtered = df[  ['name','age']  ]
df_filtered

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [54]:
df.filter(items=['age','job'])

   age        job
0   20    student
1   30  developer
2   30    teacher
3   40    dentist
4   45    manager
5   25     intern

In [55]:
df.filter(like='a',axis=1)
#column name에 a가 들어가는 columns

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [56]:
df.filter(regex='b$', axis=1)

         job
0    student
1  developer
2    teacher
3    dentist
4    manager
5     intern

In [57]:
df.filter(regex='e$', axis=1)

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [93]:
friends = [
    {'age' : 15, 'job' : 'student'},
    {'age' : 25, 'job' : 'developer'},
    {'age' : 30, 'job' : 'teacher'}
]
df = pd.DataFrame(friends, 
                  index = ['John','Jenny','Nate'],
                  columns = ['age', 'job'])
df

       age        job
John    15    student
Jenny   25  developer
Nate    30    teacher

In [60]:
df.drop(['John','Nate'])

       age        job
Jenny   25  developer

In [61]:
df

       age        job
John    15    student
Jenny   25  developer
Nate    30    teacher

In [65]:
df = df.drop(['John','Nate'])
df

       age        job
Jenny   25  developer

In [76]:
df = df.drop(['John','Nate'], inplace = True)

In [77]:
df

In [91]:
friends = [
    {'name' : 'John', 'age' : 15, 'job' : 'student'},
    {'name' : 'Ben', 'age' : 25, 'job' : 'developer'},
    {'name' : 'Jenny', 'age' : 30, 'job' : 'teacher'}
]
df = pd.DataFrame(friends, 
                  columns = ['name', 'age', 'job'])
df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [82]:
df = df.drop(df.index[[0,2]])
df

  name  age        job
1  Ben   25  developer

In [87]:
df = df[df.age > 20]
df

    name  age        job
1    Ben   25  developer
2  Jenny   30    teacher

In [92]:
df = df.drop('age', axis=1)
df

    name        job
0   John    student
1    Ben  developer
2  Jenny    teacher

In [94]:
df = df.drop('age', axis=1, inplace = True)
df

In [124]:
friend_dict_list = [
    {'name' : 'John', 'age' : 15, 'job' : 'student'},
    {'name' : 'Jenny', 'age' : 30, 'job' : 'developer'},
    {'name' : 'Nate', 'age' : 30, 'job' : 'teacher'}
]
df = pd.DataFrame(friend_dict_list, columns = ['name', 'age', 'job'])
df.head()

    name  age        job
0   John   15    student
1  Jenny   30  developer
2   Nate   30    teacher

In [100]:
#열 삽입
df['salary'] = 0
df.head()

    name  age        job  salary
0   John   15    student       0
1  Jenny   30  developer       0
2   Nate   30    teacher       0

In [101]:
import numpy as np

In [102]:
df['salary'] = np.where(df['job'] != 'student', 'yes', 'no')
df.head()

    name  age        job salary
0   John   15    student     no
1  Jenny   30  developer    yes
2   Nate   30    teacher    yes

In [115]:
friend_dict_list = [
    {'name' : 'John', 'midterm' : 95, 'final' : 85},
    {'name' : 'Jenny', 'midterm' : 85, 'final' : 80},
    {'name' : 'Nate', 'midterm' : 30, 'final' : 10}
]
df = pd.DataFrame(friend_dict_list, columns = ['name', 'midterm', 'final'])
df.head()

    name  midterm  final
0   John       95     85
1  Jenny       85     80
2   Nate       30     10

In [116]:
df['total'] = df['midterm'] + df['final']
df.head()

    name  midterm  final  total
0   John       95     85    180
1  Jenny       85     80    165
2   Nate       30     10     40

In [117]:
df['average'] = df['total'] / 2
df.head()

    name  midterm  final  total  average
0   John       95     85    180     90.0
1  Jenny       85     80    165     82.5
2   Nate       30     10     40     20.0

In [118]:
#리스트로 열 추가
grades = []
for row in df['average']:
    if row >= 90:
        grades.append('A')
    elif row >= 80:
        grades.append('B')
    else:
        grades.append('F')

df['grade'] = grades
df.head()

    name  midterm  final  total  average grade
0   John       95     85    180     90.0     A
1  Jenny       85     80    165     82.5     B
2   Nate       30     10     40     20.0     F

In [119]:
def pass_or_fail(row):
    if row != 'F':
        return 'Pass'
    else:
        return 'Fail'

In [120]:
#apply func
df.grade = df.grade.apply(pass_or_fail)
df.head()

    name  midterm  final  total  average grade
0   John       95     85    180     90.0  Pass
1  Jenny       85     80    165     82.5  Pass
2   Nate       30     10     40     20.0  Fail

In [121]:
date_list = [
    {
        'yyyy-mm-dd' : '2000-06-27'
    },
    {
        'yyyy-mm-dd' : '2007-10-27'
    }
]

df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])
df.head()

   yyyy-mm-dd
0  2000-06-27
1  2007-10-27

In [122]:
def extract_year(row):
    return row.split('-')[0]

In [123]:
df['year'] = df['yyyy-mm-dd'].apply(extract_year)
df.head()

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2007-10-27  2007

## 행 삽입

In [128]:
friend_dict_list = [
    {'name' : 'John', 'midterm' : 95, 'final' : 85},
    {'name' : 'Jenny', 'midterm' : 85, 'final' : 80},
    {'name' : 'Nate', 'midterm' : 30, 'final' : 10}
]
df = pd.DataFrame(friend_dict_list, columns = ['name', 'midterm', 'final'])
df.head()

    name  midterm  final
0   John       95     85
1  Jenny       85     80
2   Nate       30     10

In [129]:
df2 = pd.DataFrame([
    ['Ben', 50, 50]
], columns = ['name', 'midterm', 'final'])
df2.head()

  name  midterm  final
0  Ben       50     50

In [130]:
df.append(df2, ignore_index = True)

    name  midterm  final
0   John       95     85
1  Jenny       85     80
2   Nate       30     10
3    Ben       50     50

## Group by

In [131]:
student_list = [{'name': 'John', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Abraham', 'major': "Physics", 'sex': "male"},
                {'name': 'Brian', 'major': "Psychology", 'sex': "male"},
                {'name': 'Janny', 'major': "Economics", 'sex': "female"},
                {'name': 'Yuna', 'major': "Economics", 'sex': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'sex': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Zara', 'major': "Psychology", 'sex': "female"},
                {'name': 'Wendy', 'major': "Economics", 'sex': "female"},
                {'name': 'Sera', 'major': "Psychology", 'sex': "female"}
         ]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

In [132]:
groupby_major = df.groupby('major')

In [133]:
groupby_major.groups

{'Computer Science': Int64Index([0, 1, 6, 7], dtype='int64'),
 'Economics': Int64Index([4, 5, 9], dtype='int64'),
 'Physics': Int64Index([2], dtype='int64'),
 'Psychology': Int64Index([3, 8, 10], dtype='int64')}

In [134]:
for name, group in groupby_major:
    print(name + ' : ' + str(len(group)))
    print(group)
    print()

Computer Science : 4
       name             major     sex
0      John  Computer Science    male
1      Nate  Computer Science    male
6  Jeniffer  Computer Science  female
7    Edward  Computer Science    male

Economics : 3
    name      major     sex
4  Janny  Economics  female
5   Yuna  Economics  female
9  Wendy  Economics  female

Physics : 1
      name    major   sex
2  Abraham  Physics  male

Psychology : 3
     name       major     sex
3   Brian  Psychology    male
8    Zara  Psychology  female
10   Sera  Psychology  female

In [137]:
df_major_cnt = pd.DataFrame( {'count' : groupby_major.size()}  )
df_major_cnt
#major가 index되버림

                  count
major
Computer Science      4
Economics             3
Physics               1
Psychology            3

In [139]:
df_major_cnt = pd.DataFrame( {'count' : groupby_major.size()}  ).reset_index()
df_major_cnt

              major  count
0  Computer Science      4
1         Economics      3
2           Physics      1
3        Psychology      3

In [140]:
groupby_sex = df.groupby('sex')

In [141]:
for name, group in groupby_sex:
    print(name + ' : ' + str(len(group)))
    print(group)
    print()

female : 6
        name             major     sex
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

male : 5
      name             major   sex
0     John  Computer Science  male
1     Nate  Computer Science  male
2  Abraham           Physics  male
3    Brian        Psychology  male
7   Edward  Computer Science  male

## drop duplicates

In [142]:
student_list = [{'name': 'John', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Abraham', 'major': "Physics", 'sex': "male"},
                {'name': 'Brian', 'major': "Psychology", 'sex': "male"},
                {'name': 'Janny', 'major': "Economics", 'sex': "female"},
                {'name': 'Yuna', 'major': "Economics", 'sex': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'sex': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Zara', 'major': "Psychology", 'sex': "female"},
                {'name': 'Wendy', 'major': "Economics", 'sex': "female"},
                {'name': 'Sera', 'major': "Psychology", 'sex': "female"},
                {'name': 'John', 'major': "Computer Science", 'sex': "male"},
         ]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female
11      John  Computer Science    male

In [143]:
df.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11     True
dtype: bool

In [144]:
df.drop_duplicates()

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

In [145]:
student_list = [{'name': 'John', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Abraham', 'major': "Physics", 'sex': "male"},
                {'name': 'Brian', 'major': "Psychology", 'sex': "male"},
                {'name': 'Janny', 'major': "Economics", 'sex': "female"},
                {'name': 'Yuna', 'major': "Economics", 'sex': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'sex': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Zara', 'major': "Psychology", 'sex': "female"},
                {'name': 'Wendy', 'major': "Economics", 'sex': "female"},
                {'name': 'Nate', 'major': None, 'sex': "male"},
                {'name': 'John', 'major': "Computer Science", 'sex': None},
         ]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Nate              None    male
11      John  Computer Science    None

In [146]:
df.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
dtype: bool

In [147]:
df.duplicated(['name'])

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10     True
11     True
dtype: bool

In [148]:
df.drop_duplicates(['name'], keep='first')
#default:first

       name             major     sex
0      John  Computer Science    male
1      Nate  Computer Science    male
2   Abraham           Physics    male
3     Brian        Psychology    male
4     Janny         Economics  female
5      Yuna         Economics  female
6  Jeniffer  Computer Science  female
7    Edward  Computer Science    male
8      Zara        Psychology  female
9     Wendy         Economics  female

In [149]:
df.drop_duplicates(['name'], keep='last')

        name             major     sex
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Nate              None    male
11      John  Computer Science    None

## NaN

In [155]:
school_id_list = [{'name': 'John', 'job': "teacher", 'age': 40},
                {'name': 'Nate', 'job': "teacher", 'age': 35},
                {'name': 'Yuna', 'job': "teacher", 'age': 37},
                {'name': 'Abraham', 'job': "student", 'age': 10},
                {'name': 'Brian', 'job': "student", 'age': 12},
                {'name': 'Janny', 'job': "student", 'age': 11},
                {'name': 'Nate', 'job': "teacher", 'age': None},
                {'name': 'John', 'job': "student", 'age': None}
         ]
df = pd.DataFrame(school_id_list, columns = ['name', 'job', 'age'])
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher   NaN
7     John  student   NaN

In [151]:
df.shape

(8, 3)

In [152]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
name    8 non-null object
job     8 non-null object
age     6 non-null float64
dtypes: float64(1), object(2)
memory usage: 192.0+ bytes

In [153]:
df.isna()

    name    job    age
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False   True
7  False  False   True

python에서는 None이면 에러 나는 경우가 많다.

In [154]:
df.age = df.age.fillna(0)
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher   0.0
7     John  student   0.0

In [156]:
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher   NaN
7     John  student   NaN

In [157]:
df['age'].fillna(df.groupby('job')['age'].transform('median'), inplace=True)

In [158]:
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher  37.0
7     John  student  11.0

## apply func

In [175]:
date_list = [{'yyyy-mm-dd': '2000-06-27'},
         {'yyyy-mm-dd': '2002-09-24'},
         {'yyyy-mm-dd': '2005-12-20'}]
df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-24
2  2005-12-20

In [160]:
def extract_year(column):
    return column.split('-')[0]

In [162]:
#for문 대신
df['year'] = df['yyyy-mm-dd'].apply(extract_year)
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

In [163]:
def get_age(year, current_year):
    return current_year - int(year)

In [165]:
#function parameter
df['age'] = df['year'].apply(get_age, current_year=2018)
df

   yyyy-mm-dd  year  age
0  2000-06-27  2000   18
1  2002-09-24  2002   16
2  2005-12-20  2005   13

In [166]:
def get_introudce(age, prefix, suffix):
    return prefix + str(age) + suffix

In [169]:
df['introduce'] = df['age'].apply(get_introudce, prefix='I am ', suffix=' years old')
df

   yyyy-mm-dd  year  age          introduce
0  2000-06-27  2000   18  I am 18 years old
1  2002-09-24  2002   16  I am 16 years old
2  2005-12-20  2005   13  I am 13 years old

In [170]:
#apply 여러 컬럼 사용
def get_introduce_2(row):
    return "I was born in " + str(row.year) + " my age is " + str(row.age)

In [171]:
df.introduce = df.apply(get_introduce_2, axis=1)
#와 같다
#df['introduce'] = df.apply(get_introduce_2, axis=1)
df

   yyyy-mm-dd  year  age                        introduce
0  2000-06-27  2000   18  I was born in 2000 my age is 18
1  2002-09-24  2002   16  I was born in 2002 my age is 16
2  2005-12-20  2005   13  I was born in 2005 my age is 13

## map, applymap func

In [176]:
date_list = [{'date': '2000-06-27'},
         {'date': '2002-09-24'},
         {'date': '2005-12-20'}]
df = pd.DataFrame(date_list, columns = ['date'])
df

         date
0  2000-06-27
1  2002-09-24
2  2005-12-20

In [173]:
def extract_year(date):
    return date.split('-')[0]

In [177]:
df['year'] = df['date'].map(extract_year)
df

         date  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

In [178]:
job_list = [{'age': 20, 'job': 'student'},
         {'age': 30, 'job': 'developer'},
         {'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(job_list)
df

   age        job
0   20    student
1   30  developer
2   30    teacher

In [179]:
df.job = df.job.map({'student':1, 'developer':2, 'teacher':3})
df

   age  job
0   20    1
1   30    2
2   30    3

## applymap
모든 columns에 적용

In [180]:
x_y = [{'x': 5.5, 'y': -5.6},
         {'x': -5.2, 'y': 5.5},
         {'x': -1.6, 'y': -4.5}]
df = pd.DataFrame(x_y)
df

     x    y
0  5.5 -5.6
1 -5.2  5.5
2 -1.6 -4.5

In [181]:
df = df.applymap(np.around)
df

     x    y
0  6.0 -6.0
1 -5.0  6.0
2 -2.0 -4.0

## unique

In [183]:
job_list = [{'name': 'John', 'job': "teacher"},
                {'name': 'Nate', 'job': "teacher"},
                {'name': 'Fred', 'job': "teacher"},
                {'name': 'Abraham', 'job': "student"},
                {'name': 'Brian', 'job': "student"},
                {'name': 'Janny', 'job': "developer"},
                {'name': 'Nate', 'job': "teacher"},
                {'name': 'Obrian', 'job': "dentist"},
                {'name': 'Yuna', 'job': "teacher"},
                {'name': 'Rob', 'job': "lawyer"},
                {'name': 'Brian', 'job': "student"},
                {'name': 'Matt', 'job': "student"},
                {'name': 'Wendy', 'job': "banker"},
                {'name': 'Edward', 'job': "teacher"},
                {'name': 'Ian', 'job': "teacher"},
                {'name': 'Chris', 'job': "banker"},
                {'name': 'Philip', 'job': "lawyer"},
                {'name': 'Janny', 'job': "basketball player"},
                {'name': 'Gwen', 'job': "teacher"},
                {'name': 'Jessy', 'job': "student"}
         ]
df = pd.DataFrame(job_list, columns = ['name', 'job'])
df

       name                job
0      John            teacher
1      Nate            teacher
2      Fred            teacher
3   Abraham            student
4     Brian            student
5     Janny          developer
6      Nate            teacher
7    Obrian            dentist
8      Yuna            teacher
9       Rob             lawyer
10    Brian            student
11     Matt            student
12    Wendy             banker
13   Edward            teacher
14      Ian            teacher
15    Chris             banker
16   Philip             lawyer
17    Janny  basketball player
18     Gwen            teacher
19    Jessy            student

In [184]:
df.job.unique()

array(['teacher', 'student', 'developer', 'dentist', 'lawyer', 'banker',
       'basketball player'], dtype=object)

In [185]:
df.job.value_counts()

teacher              8
student              5
lawyer               2
banker               2
dentist              1
basketball player    1
developer            1
Name: job, dtype: int64

In [186]:
l1 = [{'name': 'John', 'job': "teacher"},
      {'name': 'Nate', 'job': "student"},
      {'name': 'Fred', 'job': "developer"}]

l2 = [{'name': 'Ed', 'job': "dentist"},
      {'name': 'Jack', 'job': "farmer"},
      {'name': 'Ted', 'job': "designer"}]
         
df1 = pd.DataFrame(l1, columns = ['name', 'job'])
df2 = pd.DataFrame(l2, columns = ['name', 'job'])

In [187]:
df1

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer

In [188]:
df2

   name       job
0    Ed   dentist
1  Jack    farmer
2   Ted  designer

In [191]:
result = pd.concat([df1, df2])
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
0    Ed    dentist
1  Jack     farmer
2   Ted   designer

In [192]:
result = pd.concat([df1, df2], ignore_index=True)
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
3    Ed    dentist
4  Jack     farmer
5   Ted   designer

In [193]:
result = df1.append(df2)
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
0    Ed    dentist
1  Jack     farmer
2   Ted   designer

In [194]:
result = df1.append(df2, ignore_index=True)
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
3    Ed    dentist
4  Jack     farmer
5   Ted   designer

In [196]:
l3 = [{'name': 'John', 'job': "teacher"},
      {'name': 'Nate', 'job': "student"},
      {'name': 'Jack', 'job': "developer"}]

l4 = [{'age': 25, 'country': "U.S"},
      {'age': 30, 'country': "U.K"},
      {'age': 45, 'country': "Korea"}]

df1 = pd.DataFrame(l3, columns = ['name', 'job'])
df2 = pd.DataFrame(l4, columns = ['age', 'country'])

In [197]:
df1

   name        job
0  John    teacher
1  Nate    student
2  Jack  developer

In [198]:
df2

   age country
0   25     U.S
1   30     U.K
2   45   Korea

In [200]:
result = pd.concat([df1, df2], axis=1, ignore_index=True)
result

      0          1   2      3
0  John    teacher  25    U.S
1  Nate    student  30    U.K
2  Jack  developer  45  Korea

### list 합치기

In [201]:
label = [1,2,3,4,5]
prediction = [1,2,2,4,4]

In [202]:
comparison = pd.DataFrame({'label':label, 'prediction':prediction})
comparison

   label  prediction
0      1           1
1      2           2
2      3           2
3      4           4
4      5           4